
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	СоздатьНастройку = Истина;
КонецПроцедуры

&НаКлиенте
Процедура Далее(Команда)
	ТекСтраница = Элементы.Страницы.ТекущаяСтраница;
	Если ТекСтраница = Элементы.НачальнаяСтраница Тогда
		Если СоздатьНастройку Тогда
			Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаСозданияНастройки;
		ИначеЕсли ИзменитьНастройку Тогда
			Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаСозданияНастройки;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьНастройкуПриИзменении(Элемент)
	ИзменитьНастройку = Не СоздатьНастройку;
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьНастройкуПриИзменении(Элемент)
	СоздатьНастройку = Не ИзменитьНастройку;
КонецПроцедуры


